vaynersystems/esp32-mvc-secure-iot-server/src/System/MODULES/DEVICES/esp32_devices.cpp
//Notes:   This isa hacky approach because I couldn't get generic list of devices that supports different types of storage for reads and writes.
//         someone with a stronger c/c++ background can likely resolve this with little effort.
#include "esp32_devices.hpp"
#include <esp32-hal-gpio.h>
#include "esp32_scheduling_manager.hpp"

extern esp32_scheduling_manager scheduleManager;
void esp32_devices::onInit()
{
    #ifdef DEBUG_DEVICE
    Serial.println(F("Initializing device manager"));
    #endif
    loadDeviceConfiguration();
    auto devicePins = pinManager.getControllerPins();
    
    for(int idx=0; idx < _devices.size();idx++){
        #ifdef DEBUG_DEVICE
        Serial.printf("Initializing device #%d: %s\n", idx + 1, _devices[idx].name.c_str() );
        #endif
        switch(_devices[idx].type){
            case esp32_device_type::AnalogInput:
            case esp32_device_type::DigitalInput:
                pinMode(_devices[idx].pin, INPUT);
                 _devices[idx].initialized = true;

                break;
            case esp32_device_type::Thermometer:
                pinMode(_devices[idx].pin, INPUT);
                //init one wire
                oneWire = OneWire(_devices[idx].pin);
                sensors.setOneWire(&oneWire);                
                sensors.setPullupPin(_devices[idx].pin);
                sensors.begin();
                 //9 bit takes 155ms, 12bit 810ms. default to 10 bit, giving ~0.45F resolution
                sensors.setResolution(_devices[idx].resolution > 0 ? _devices[idx].resolution  : 10);
                 _devices[idx].initialized = true;
                break;

            case esp32_device_type::Switch:
            case esp32_device_type::Relay:
                for(int pinIdx = 0; pinIdx < devicePins.size();pinIdx++){
                    if(devicePins[pinIdx].gpioPin == _devices[idx].pin){
                        //pin exists on controller
                        if(devicePins[pinIdx].pinMode == GPIO_MODE_INPUT){
                            Serial.printf("Configured pin %d for device %s is set to output, but controller does not support output on this pin\n",
                                devicePins[pinIdx].gpioPin, _devices[idx].name.c_str()
                            );                            
                        } else{
                            Serial.printf("Configuring pin %d for device %s to output\n", devicePins[pinIdx].gpioPin, _devices[idx].name.c_str());
                            pinMode(_devices[idx].pin, OUTPUT);
                            if(_devices[idx].signal != activeHigh){
                                digitalWrite(_devices[idx].pin, HIGH);
                            }
                            _devices[idx].initialized = true;
                        }
                        break;
                    }
                }
                if(!_devices[idx].initialized)
                    Serial.printf("[esp32_devices] ERROR: Output device %s not intitialized! Pin %d not found in controller. Check your device configuration!\n",
                        _devices[idx].name.c_str(), _devices[idx].pin
                    );
                
                break;
            case esp32_device_type::Unknown:
                Serial.printf("esp32_devices] ERROR: Device %s not intilaized! Device type is unknown. Check your device configuration!\n",
                    _devices[idx].name.c_str(), _devices[idx].pin
                );
                break;
        }     
        lcd.addMessage(_devices[idx].name.c_str(),string_format("DEV #%d",_devices[idx].id).c_str());        
    
    }
    
    #ifdef DEBUG
    Serial.println(F("Done initializing devices"));
    #endif
}


void esp32_devices::onLoop()
{   
    auto seriesEntry = _scratchpad.to<JsonObject>();
    
    tm now = getDate();
    auto date = string_format("%02d/%02d/%d %02d:%02d:%02d", now.tm_mon + 1, now.tm_mday, now.tm_year + 1900, now.tm_hour, now.tm_min, now.tm_sec);
    seriesEntry["time"] = date;
    auto seriesEntries = seriesEntry["series"].to<JsonArray>();
    // get all devices. For each device, read value, store in object
    // if output device, determine desired state. set state if not already set to desired state. 

    /* Read all states */
    /* NOTE: could use arduino json's .is(T) method to test for type instead of storing manually */
    for (int idx = 0; idx < _devices.size(); idx++){        
        if(!_devices[idx].initialized) continue;
        int pin = _devices[idx].pin;
        esp32_device_type type = _devices[idx].type;
        JsonObject deviceSeriesEntry = seriesEntries.createNestedObject();
        bool timeToPublish = mqtt.enabled() && _devices[idx].mqttPublish && millis() - _devices[idx].lastPublishTime > _devices[idx].mqttFrequency * 60000 ;
        
        deviceSeriesEntry["id"] = _devices[idx].id;
        getDeviceState( _devices[idx].id, deviceSeriesEntry);        

        switch(type){
            case esp32_device_type::AnalogInput:
            case esp32_device_type::DigitalInput:
            case esp32_device_type::Thermometer:
            {
                if(timeToPublish && !deviceSeriesEntry["value"].isNull()){
                    mqtt.publish(_devices[idx].mqttTopic.c_str(),deviceSeriesEntry["value"].as<string>().c_str());
                    _devices[idx].lastPublishTime = millis();
                }
                
            }       
        }
    }

    if(millis() - _lastSnapshotStoreTime > _snapshotFrequency){
        logger.logSnapshot(seriesEntry);
        _lastSnapshotStoreTime = millis();
    }
    _snapshot.clear();
    _snapshot.set(seriesEntry);
    
    
    /* Write output states */
    for (int idx = 0; idx < _devices.size(); idx++){    
        auto device = _devices[idx]; 
        if(!device.initialized) continue;
        if(scheduleManager.isManaged(device.id)) continue; //if managed by schedule, skip
        if(_devices[idx].managedByScheduler) continue; //if device is managed by system scheduler, do not manually set state.   
        int pin = _devices[idx].pin;    
        if(_devices[idx].type != Switch && _devices[idx].type != Relay) continue;
        //determine state
        if(!_devices[idx].useTrigger)
            continue; //until scheduling is implemented, nothing to do for output device without trigger
        
        auto sourceDeviceStateIdx = findDeviceStateIndex(seriesEntries, _devices[idx].triggerDeviceId);
        auto destinationDeviceIdx = findDeviceStateIndex(seriesEntries, _devices[idx].id);

        if(sourceDeviceStateIdx < 0 || destinationDeviceIdx < 0) 
            continue; //canot process

        bool electricCurrentState = seriesEntries[destinationDeviceIdx]["value"].as<bool>();
        bool currentState = _devices[idx].signal == activeLow ? !electricCurrentState : electricCurrentState;
        
        if(_devices[idx].signal == activeLow ){
            seriesEntries[destinationDeviceIdx]["value"] = !seriesEntries[destinationDeviceIdx]["value"].as<bool>();
        }

