vaynersystems/esp32-mvc-secure-iot-server/src/System/MODULES/DEVICES/esp32_devices.cpp
        #ifdef DEBUG_DEVICE
        ESP_LOGD(PROGRAM_TAG,"Main device loop. Checking device %s state\n", _devices[idx].name.c_str());
        #endif
        //switch should maintain the state it had previously
        bool shouldBeOn = getDesiredState(
            currentState,
            _devices[idx].triggerType,
            seriesEntries[sourceDeviceStateIdx]["value"],
            _devices[idx].triggerValue,
            _devices[idx].triggerThreshold);

        bool electricShouldBeOn = _devices[idx].signal == activeLow ? !shouldBeOn : shouldBeOn;

        #ifdef DEBUG_DEVICE
        ESP_LOGD(PROGRAM_TAG,"Main device loop. Checking device %s state\n\tActive %s\n\tElectric Is On: %s\n\tIs On: %s\n\tShould Be On: %s\n\tElectric Should Be On: %s\n",
            _devices[idx].name.c_str(), 
            _devices[idx].signal == esp32_device_signal::activeHigh ? "HIGH" : "LOW",
            electricCurrentState ? "ON" : "OFF", currentState ? "ON" : "OFF", shouldBeOn ? "ON" : "OFF", electricShouldBeOn ? "ON" : "OFF");
        #endif

        if(!currentState && shouldBeOn)
            logger.logInfo(string_format("%s ON at %s", _devices[idx].name.c_str(), date.c_str()).c_str(), esp32_log_type::device);
        else if(currentState && !shouldBeOn)
            logger.logInfo(string_format("%s OFF at %s", _devices[idx].name.c_str(), date.c_str()).c_str(), esp32_log_type::device);  

        switch(_devices[idx].type){            
           
            case esp32_device_type::Switch:            
            {
                

                auto device = esp32_switch_device(pin);
                //if desired state is different that current state, change it
                if(currentState != shouldBeOn){
                    #if DEBUG_DEVICE > 0
                    Serial.printf("Setting device %s with state %s to %s\n", _devices[idx].name.c_str(), currentState ? "on" : "off", shouldBeOn ? "on" : "off");
                    #endif
                   
                    lcd.set(_devices[idx].name.c_str(), shouldBeOn ? "Turning ON (trigger)" : "Turning OFF (trigger)");
                    device.setValue(electricShouldBeOn);  
                   if(_devices[idx].mqttPublish && mqtt.enabled())
                        mqtt.publish(_devices[idx].mqttTopic.c_str(), shouldBeOn  ? "On" : "Off");                   
                }
            }            
            break;
            case esp32_device_type::Relay:
            {
                //if relay is on:
                //   1. we will want to reset the timer if the state says it should be on.
                //   2. otherwise we check if it should be turned off (timed out)
                //if relay is off:
                //   1.  we will turn it on (same as "on 1.") is desired state is to turn on
                //   2.  otherwise do nothing
                
                auto device = esp32_relay_device(pin, _devices[idx].lastStartTime);
                if(shouldBeOn){
                    #if DEBUG_DEVICE > 0
                    Serial.printf("Setting device %s with state %s to %s\n", _devices[idx].name.c_str(), currentState ? "on" : "off", shouldBeOn ? "on" : "off");
                    #endif
                    lcd.set(_devices[idx].name.c_str(), shouldBeOn ? " Turning ON (trigger)" : "Turning OFF (trigger)");
                    device.setValue(electricShouldBeOn);
                    _devices[idx].lastStartTime = millis();
                }
                
                if(device.turnOffIfTime(_devices[idx].duration))
                    logger.logInfo(string_format("%s OFF at %s", _devices[idx].name.c_str(), date.c_str()).c_str(), esp32_log_type::device);
            }            
            break;
            //no output actions for input devices
            case esp32_device_type::AnalogInput:
            case esp32_device_type::DigitalInput:
            case esp32_device_type::Thermometer:
            case esp32_device_type::Unknown:            
                continue;
            break;
        }
    }
    _lastSnapshotTime = millis();
}

bool esp32_devices::getDesiredState(
    bool currentState,
    esp32_device_trigger_type triggerType, 
    JsonVariant value, 
    double triggerValue,
    unsigned long triggerThreshold
){
    bool shouldBeOn = currentState; // switch value is a boolean, safe to cast

    #if DEBUG_DEVICE > 1
    Serial.printf("Getting desired state with current target state %s, trigger type %s with trigger value %f and threshold %lu\n",
        currentState ? "ON" : "OFF", triggerType == LessThan ? "<" : triggerType == GreaterThan ? ">" : "=", triggerValue, triggerThreshold
    );
    #endif
    switch (triggerType)
    {
        case esp32_device_trigger_type::LessThan:{
            shouldBeOn = isLessThan(currentState, value, triggerValue, triggerThreshold);
        }
            break;
        case esp32_device_trigger_type::GreaterThan:
            shouldBeOn = isGreaterThan(currentState, value, triggerValue, triggerThreshold);
            break;

        case esp32_device_trigger_type::Equals:
            shouldBeOn = isEqualTo(value, triggerValue);
            break;
        
        default:
            break;
    }
    return shouldBeOn;
}

bool esp32_devices::isLessThan(bool currentState, JsonVariant value, double triggerValue, unsigned long triggerThreshold){
    if(value.isNull()){
        Serial.printf("Value is null!!\n");
        return false;
    }
    if(value.is<uint16_t>()){
        uint16_t sourceDeviceValue = value.as<uint16_t>();
        return sourceDeviceValue < (currentState ? triggerValue + triggerThreshold : triggerValue);

    } 
    else if(value.is<double>()){
        double sourceDeviceValue = value.as<double>();
        return sourceDeviceValue < (currentState ? triggerValue + triggerThreshold : triggerValue);

    }
    else if(value.is<float>()){
        float sourceDeviceValue = value.as<float>();
        return sourceDeviceValue < (currentState ? triggerValue + triggerThreshold : triggerValue);

