vaynersystems/esp32-mvc-secure-iot-server/src/System/MODULES/DEVICES/esp32_devices.cpp
    }
    else if(value.is<bool>()){    
        bool sourceDeviceValue = value.as<bool>();
        return sourceDeviceValue < (currentState ? triggerValue + triggerThreshold : triggerValue);
    }
    else if(value.is<int>()){
        double sourceDeviceValue = value.as<int>();
        return sourceDeviceValue < (currentState ? triggerValue + triggerThreshold : triggerValue);
    }
    else if(value.is<short>()){
        double sourceDeviceValue = value.as<int>();
        return sourceDeviceValue < (currentState ? triggerValue + triggerThreshold : triggerValue);
    }
    else if(value.is<const char *>()) {
        Serial.printf("Error occured checking less than condition. value type is const char * %d\n", value.as<const char *>());
        double sourceDeviceValue = value.as<int>();
        return sourceDeviceValue < (currentState ? triggerValue + triggerThreshold : triggerValue);
    }
    else {
        Serial.printf("Error occured checking less than condition. value type is unknown %d : %s\n", value.as<int>(),  value.as<const char *>());
        double sourceDeviceValue = value.as<int>();
        return sourceDeviceValue < (currentState ? triggerValue + triggerThreshold : triggerValue);
    }
    
    return false;
}

bool esp32_devices::isGreaterThan(bool currentState, JsonVariant value, double triggerValue, unsigned long triggerThreshold)
{
    if(value.isNull()){
        Serial.printf("Value is null!!\n");
        return false;
    }
    if(value.is<uint16_t>()){
        uint16_t sourceDeviceValue = value.as<uint16_t>();
        return sourceDeviceValue > (currentState ? triggerValue - triggerThreshold : triggerValue);

    } 
    else if(value.is<double>()){
        double sourceDeviceValue = value.as<double>();
        return sourceDeviceValue > (currentState ? triggerValue - triggerThreshold : triggerValue);

    }
    else if(value.is<bool>()){    
        bool sourceDeviceValue = value.as<bool>();
        return sourceDeviceValue > (currentState ? triggerValue - triggerThreshold : triggerValue);
    }
    else {
        Serial.printf("Error occured checking greater than condition. value type is unknown %d : %s\n", value.as<int>(),  value.as<const char *>());
        double sourceDeviceValue = value.as<int>();
        return sourceDeviceValue < (currentState ? triggerValue + triggerThreshold : triggerValue);
    }
    return false;
}

bool esp32_devices::isEqualTo( JsonVariant value, double triggerValue)
{
    if(value.isNull()){
        Serial.printf("Value is null!!\n");
        return false;
    }
    if(value.is<uint16_t>()){
    //if(type == "uint16_t"){
        uint16_t sourceDeviceValue = value.as<uint16_t>();
        uint16_t tv = static_cast<uint16_t>(triggerValue);
        Serial.printf("Checking if %u is equal to %u\n", sourceDeviceValue, tv);
        return sourceDeviceValue == triggerValue;

    }
    //else if(type == "double"){
    else if(value.is<double>()){
        double sourceDeviceValue = value.as<double>();
        Serial.printf("Checking if %lf is equal to %lf\n", sourceDeviceValue, triggerValue);
        return sourceDeviceValue == triggerValue;

    }
    else if(value.is<bool>()){
    //else if(type == "bool"){}
    
        bool sourceDeviceValue = value.as<bool>();
        return sourceDeviceValue == triggerValue;
    }
    else {
        Serial.printf("Error occured checking equal to condition. value type is unknown %d : %s\n", value.as<int>(),  value.as<const char *>());
        double sourceDeviceValue = value.as<int>();
        return sourceDeviceValue ==triggerValue;
    }
    return false;
}

JsonObject esp32_devices::findDeviceState(JsonArray deviceStates, int deviceId){
    for(JsonObject deviceState : deviceStates){
        if(!deviceState["id"].isNull() && deviceState["id"].as<int>() == deviceId){            
            return deviceState;        
        }
            
    }
    #ifdef DEBUG
    Serial.println("Not found");
    #endif
    return JsonObject();
}

int esp32_devices::findDeviceStateIndex(JsonArray deviceStates, int deviceId)
{
    int idx = 0;
    for(JsonObject deviceState : deviceStates){
        if(!deviceState["id"].isNull() && deviceState["id"].as<int>() == deviceId){      
            #ifdef DEBUG_DEVICE
                #if DEBUG_DEVICE > 2
                Serial.printf("Found device state idx %d for device idx %d\n", idx, deviceId);
                #endif      
            #endif
            return idx;        
        }
        idx++;
            
    }
    
    return -1;
}

// const char * esp32_devices::getDeviceState(int deviceId){
//     for(int deviceIdx = 0; deviceIdx < _devices.size(); deviceIdx++){
//         if(_devices[deviceIdx].id == deviceId){
//             switch(_devices[deviceIdx].type){
//                 case esp32_device_type::AnalogInput:
//                 {
//                     auto device = esp32_analog_input_device(_devices[deviceIdx].pin);
//                     return string_format( "%ul",device.getValue()).c_str();
//                     //return returnValue;                
                    
//                 }
//                 break;
//                 case esp32_device_type::DigitalInput:
//                 {
//                     auto device = esp32_digital_input_device(_devices[deviceIdx].pin);
//                     return string_format( "%d",device.getValue()).c_str();
//                     //return returnValue; 
//                 }
                    
//                 break;
//                 case esp32_device_type::Thermometer:{
//                     auto device = esp32_thermometer_device(_devices[deviceIdx].pin);                               
//                     return string_format( "%.2f",device.getValue()).c_str();
//                     //return returnValue;      
//                 }          
//                 break;
//                 case esp32_device_type::Switch:
//                 {
//                     auto device = esp32_switch_device(_devices[deviceIdx].pin);
//                     return device.getValue() ? "On" : "Off";
//                     //return returnValue; 
//                 }            
//                 break;
//                 case esp32_device_type::Relay:
//                 {
//                     auto device = esp32_relay_device(_devices[deviceIdx].pin);
//                     return device.getValue() ? "On" : "Off";
//                     //return returnValue; 
//                 }            
//                 break;
//                 case esp32_device_type::Unknown:            
//                     continue;
//                 break;
//             }
//             break;
//         }
//     }
// }
void esp32_devices::getDeviceState(int deviceId, JsonObject object){
    
    for(int deviceIdx = 0; deviceIdx < _devices.size(); deviceIdx++){
        if(_devices[deviceIdx].id == deviceId){
            #if DEBUG_DEVICE > 1
            Serial.printf("Getting device [%d]%s state:\n\t", _devices[deviceIdx].id, _devices[deviceIdx].name.c_str());
            #endif
            object["uom"] = "";
            switch(_devices[deviceIdx].type){
                case esp32_device_type::AnalogInput:
                {
                    auto device = esp32_analog_input_device(_devices[deviceIdx].pin);
                    object["value"] = device.getValue();
                    //return returnValue;                
                    
