vaynersystems/esp32-mvc-secure-iot-server/src/System/MODULES/DEVICES/esp32_devices.cpp
                }
                break;
                case esp32_device_type::DigitalInput:
                {
                    auto device = esp32_digital_input_device(_devices[deviceIdx].pin);
                    object["value"] = device.getValue();
                    //return returnValue; 
                }
                    
                break;
                case esp32_device_type::Thermometer:{
                    auto device = esp32_thermometer_device(_devices[deviceIdx].pin);                               
                    object["value"] = device.getValue();
                    //object["uom"] = string_format("%c%s",(char)0xdf, "F"); //FUNKS UP THE SOCKET CALL
                    object["uom"] = " F";
                    //return returnValue;      
                }          
                break;
                case esp32_device_type::Switch:
                {
                    auto device = esp32_switch_device(_devices[deviceIdx].pin);
                    object["value"] = device.getValue();
                    object["type"] = "bool";
                    //return returnValue; 
                }            
                break;
                case esp32_device_type::Relay:
                {
                    auto device = esp32_relay_device(_devices[deviceIdx].pin);
                    object["value"] = device.getValue();
                    object["type"] = "bool";
                    //return returnValue; 
                }            
                break;
                case esp32_device_type::Unknown:            
                    continue;
                break;
            }
            break;
        }
    }
    
    // if(!_snapshot.isNull()){
    //     for(int idx = 0; idx < _snapshot.size(); idx++){
    //         if(_snapshot[idx]["id"].as<int>() == deviceId )
    //         return _snapshot[idx]["id"]["value"];
    //     }
    // }
}

bool esp32_devices::setDeviceState(int deviceId, bool value){
    bool set = false;
    for(int idx = 0; idx < _devices.size();idx++)
        if(_devices[idx].id == deviceId){
            switch (_devices[idx].type)
            {
                case Switch:
                {
                    auto device = esp32_switch_device(_devices[idx].pin);
                    device.setValue(value);
                    set = true;
                }
                    break;
                case Relay:
                {
                    auto device = esp32_relay_device(_devices[idx].pin);
                    device.setValue(value);
                    set = true;
                }
                    break;
            
                default:
                    break;
            }
            
            if(_devices[idx].mqttPublish && mqtt.enabled())
                mqtt.publish(_devices[idx].mqttTopic.c_str(), value  ? "On" : "Off");  
        }
    return set;
}
                 
                

vector<esp32_device_info> esp32_devices::_getDevices()
{
    StaticJsonDocument<2048> configFile;
    auto drive = filesystem.getDisk(0);
    File f = drive->open(PATH_DEVICE_CONFIG,"r");
    auto error = deserializeJson(configFile, f);
    if(error.code() != ESP_OK){
        Serial.printf("Failed to get devices. Received error deserializing configuration file. \n\t %d %s\n", error.code(), error.c_str());
    }
    f.close();    
    _devices.clear();
    if(configFile["devices"].isNull()){
        
        #ifdef DEBUG_DEVICE
        Serial.println("No devices found in configuration file");
        serializeJson(configFile, Serial);
        #endif

        return _devices;
    }
        
    auto devicesConfig = configFile["devices"].as<JsonArray>();    
    #ifdef DEBUG_DEVICE
    Serial.printf("Loaded device config:");
    serializeJson(devicesConfig, Serial);
    Serial.println();
    #endif

    for(int idx = 0; idx < devicesConfig.size();idx++){
        esp32_device_info deviceConfig;
        deviceConfig.id = devicesConfig[idx]["id"];
        deviceConfig.name = devicesConfig[idx]["name"].as<string>();
        deviceConfig.pin = devicesConfig[idx]["pin"];
        if(
            !devicesConfig[idx]["trigger"].isNull() && 
            !devicesConfig[idx]["trigger"]["active"].isNull() &&
            !devicesConfig[idx]["trigger"]["source"].isNull() && 
            !devicesConfig[idx]["trigger"]["type"].isNull()
        ){
            deviceConfig.useTrigger = devicesConfig[idx]["trigger"]["active"].as<bool>();
            deviceConfig.triggerDeviceId = devicesConfig[idx]["trigger"]["source"];
            deviceConfig.triggerType = triggerTypeFromName(devicesConfig[idx]["trigger"]["type"]);
            deviceConfig.triggerValue = devicesConfig[idx]["trigger"]["value"];
            deviceConfig.triggerThreshold = devicesConfig[idx]["trigger"]["threshold"].isNull() ? 0 : atoi(devicesConfig[idx]["trigger"]["threshold"].as<const char *>());
        }
        if(!devicesConfig[idx]["mqtt"].isNull()){
            deviceConfig.mqttPublish = !devicesConfig[idx]["mqtt"].isNull() && devicesConfig[idx]["mqtt"]["publish"].as<bool>();
            if(deviceConfig.mqttPublish){
                deviceConfig.mqttTopic = devicesConfig[idx]["mqtt"]["topic"].as<const char*>();
                deviceConfig.mqttFrequency = devicesConfig[idx]["mqtt"]["frequency"].as<int>();
            }   
        }
        if(!devicesConfig[idx]["resolution"].isNull()){
            deviceConfig.resolution = devicesConfig[idx]["resolution"].as<uint8_t>();
        } else deviceConfig.resolution = 10;
        
        deviceConfig.signal = (!devicesConfig[idx]["signal"].isNull() && strcmp(devicesConfig[idx]["signal"].as<const char*>(), "low") == 0) ? activeLow : activeHigh;

        deviceConfig.type = typeFromTypeName(devicesConfig[idx]["type"]);       
        if(deviceConfig.type == Relay)
            deviceConfig.duration =  devicesConfig[idx]["duration"].isNull() ? 5000 : devicesConfig[idx]["duration"].as<int>() * 1000;

        #ifdef DEBUG_DEVICE  
        Serial.printf("Adding device to list:\n\tID: \t\t%d\n\tName: \t\t%s\n\tType: \t\t%s%s\n\tPin: \t\t%d\n\tHas Trigger: \t%s\n\tSignal: \t%s\n",
            deviceConfig.id,    
            deviceConfig.name.c_str(),
            deviceConfig.type == AnalogInput ? "Analog" :
                deviceConfig.type == DigitalInput ? "Digital" :
                deviceConfig.type == Thermometer ? "Thermometer" :
                deviceConfig.type == Switch ? "Switch" : "Relay",
            deviceConfig.type == Relay ? string_format("\n\tDuration: 't%d seconds",deviceConfig.duration / 1000).c_str() : "",
            deviceConfig.pin,    
            deviceConfig.useTrigger ? "Yes" : "No" ,           
            deviceConfig.signal == activeHigh ? "Active High" : "Active Low" 
        );

