vaynersystems/esp32-mvc-secure-iot-server/src/System/MODULES/DEVICES/esp32_devices.cpp
        if(deviceConfig.useTrigger){
            Serial.printf("\tTrigger Source: %d\n\tTrigger Type: \t%c\n\tTrigger Value\t%lf\n\tTrigger Threshold:%lu\n",
                deviceConfig.triggerDeviceId,
                deviceConfig.triggerType == LessThan ? '<' : 
                    deviceConfig.triggerType == GreaterThan? '>' : '=',
                deviceConfig.triggerValue,
                deviceConfig.triggerThreshold

            );
        }
        if(deviceConfig.type == Thermometer){
            Serial.printf("\tResolution:\t%d\n",
                deviceConfig.resolution
            );
        }
        #endif

        _devices.push_back(deviceConfig);
    }

    return _devices;
}

StaticJsonDocument<1024> esp32_devices::getLastSnapshot()
{
    return _snapshot;
}

vector<esp32_device_info>* esp32_devices::getDevices()
{
    return &_devices;
}

// vector<esp32_device_info> esp32_devices::getDeviceConfiguration()
// {
//     return _devices;
// }

bool esp32_devices::loadDeviceConfiguration()
{
    StaticJsonDocument<2048> systemConfig;
    esp32_config::getConfigSection("system", &systemConfig);   
    if(!systemConfig["logging"].isNull()){
        if(!systemConfig["logging"]["frequency"].isNull())
            _snapshotFrequency = systemConfig["logging"]["frequency"].as<unsigned long>() * 1000;
    }
    #ifdef DEBUG_DEVICE
    Serial.printf("Setting snapshot frequency to %d seconds\n", _snapshotFrequency/1000);
    #endif
    
    return _getDevices().size() > 0;
}

esp32_device_type esp32_devices::typeFromTypeName(const char * typeName){    
    if(strcmp(typeName, "AnalogInput") == 0)
        return esp32_device_type::AnalogInput ;
    if(strcmp(typeName, "DigitalInput") == 0)
        return esp32_device_type::DigitalInput ;
    if(strcmp(typeName, "Thermometer") == 0)
        return esp32_device_type::Thermometer ;
    if(strcmp(typeName, "Switch") == 0)
        return esp32_device_type::Switch ;
    if(strcmp(typeName, "Relay") == 0)
        return esp32_device_type::Relay;
    return esp32_device_type::Unknown;
}

esp32_device_trigger_type esp32_devices::triggerTypeFromName(const char *triggerTypeName)
{
    if(strcmp(triggerTypeName,"<") == 0)
        return  LessThan;
    if(strcmp(triggerTypeName,"=") == 0)
        return  Equals;
    if(strcmp(triggerTypeName,">") == 0)
        return  GreaterThan;
    return esp32_device_trigger_type::Equals; //default
}

DallasTemperature sensors;